/**************************************************************************
* 版权声明：Copyright@2020 上海东软载波微电子有限公司
* 文件名称：key.h
* 功能描述：按键处理函数
* 函数列表：back_key_task
			ok_key_task
			scroll_key_task
* 文件作者：weiww  
* 文件版本：1.0 
* 完成日期：2020-04-01	
* 修订历史：
* 修订日期：
**************************************************************************/
#ifndef _KEY_H_
#define _KEY_H_

#include "type.h"

/**************************************************************************
* 函数名称：back_key_task
* 功能描述：back按键处理
* 输入参数：无
* 返回参数：无
**************************************************************************/
void back_key_task(void);

/**************************************************************************
* 函数名称：ok_key_task
* 功能描述：ok按键处理
* 输入参数：无
* 返回参数：无
**************************************************************************/
void ok_key_task(void);

/**************************************************************************
* 函数名称：scroll_key_task
* 功能描述：scroll按键处理
* 输入参数：无
* 返回参数：无
**************************************************************************/
void scroll_key_task(void);

#endif
