/**************************************************************************
* 版权声明：Copyright@2019 上海东软载波微电子有限公司
* 文件名称：spi.h
* 功能描述：spi通讯函数
* 函数列表：	
* 文件作者：Ljj  
* 文件版本： 
* 完成日期：2023-08-23	
* 修订历史：
* 修订日期：
**************************************************************************/
#ifndef _SPI_H_
#define _SPI_H_
#include "type.h"

#define TCSN     PCT0
#define TSCK     PBT4
#define TMOSI    PBT5
#define TMISO    PBT6

#define CSN      PC0
#define SCK      PB4
#define MOSI     PB5
#define MISO     PB6

/**************************************************************************
* 函数名称：spi_init
* 功能描述：初始化spi
* 输入参数：无
* 返回参数：无
**************************************************************************/
void spi_init(void);

/**************************************************************************
* 函数名称：hw2000b_write_reg
* 功能描述：写hw2000b寄存器
* 输入参数：addr  寄存器地址
            value 寄存器值
* 返回参数：无
**************************************************************************/
void hw2000b_write_reg(uint8_t addr, uint16_t value);

/**************************************************************************
* 函数名称：hw2000b_read_reg
* 功能描述：读hw2000b寄存器
* 输入参数：addr  寄存器地址
* 返回参数：value 寄存器值
**************************************************************************/
uint16_t hw2000b_read_reg(uint8_t addr);

/**************************************************************************
* 函数名称：hw2000b_write_fifo
* 功能描述：写hw2000b FIFO
* 输入参数：addr   FIFO地址
            data   数据地址
            length 数据长度
* 返回参数：无
**************************************************************************/
void hw2000b_write_fifo(uint8_t addr, uint8_t *data, uint8_t length);

/**************************************************************************
* 函数名称：hw2000b_read_fifo
* 功能描述：写hw2000b FIFO
* 输入参数：addr   FIFO地址
            data   数据地址
            length 数据长度
* 返回参数：无
**************************************************************************/
void hw2000b_read_fifo(uint8_t addr, uint8_t *data, uint8_t length);

#endif
